# 1. Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 

number = int(input('Введите трехзначное число '))
c = number % 10
print (c)
b = number // 10 % 10
print (b)
a = number // 100 % 10
print (a)
print ('сумма цифр равна ', a + b + c)